04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/floatingObjectWaves/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField
{
    type        waveVelocity;
    libs        ("libwaves.so");
}

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    sides
    {
        type            waveVelocity;
        libs            ("libwaves.so");
    }

    bottom
    {
        type            noSlip;
    }

    atmosphere
    {
        type            pressureInletOutletVelocity;
    }

    floatingObject
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
