04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/floatingObjectWaves/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rigidBodyState
{
    type           rigidBodyState;
    libs           ("librigidBodyState.so");
    angleUnits     [deg];
    angularVelocityUnits [deg/s];
}

rigidBodyForces
{
    type            rigidBodyForces;
    libs            ("librigidBodyForces.so");
    body            floatingObject;
    patches         (floatingObject);
    log             on;
    writeControl    timeStep;
    writeInterval   1;
}

// ************************************************************************* //
